InformationRegisters/МестаОсуществленияДеятельностиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаОсуществленияДеятельностиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВетИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПодконтрольныхОбъектовВетИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМОД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаОсуществленияДеятельностиИСМП/Forms/ФормаРегистрацииМОДВСервисе/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПервоначальныеСведения();
	УстановитьВидимостьДоступностьЭлементовФормы();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресМОДСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// Если представление было изменено в поле и сразу нажата кнопка выбора, то необходимо 
	// привести данные в соответствие и сбросить внутренние поля для повторного разбора.
	Если Элемент.ТекстРедактирования <> АдресМОДСтрокой Тогда
		АдресМОДСтрокой = Элемент.ТекстРедактирования;
		АдресМОД        = "";
	КонецЕсли;
	
	// Данные для редактирования
	ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформацииАдресаМОД, АдресМОД, АдресМОДСтрокой, КомментарийАдресаМОД);
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Адрес'");
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМОДСтрокойПриИзменении(Элемент)
	
	Текст = Элемент.ТекстРедактирования;
	Если ПустаяСтрока(Текст) Тогда
		ОчиститьВнутренниеЗначенияПолейАдресаМОД();
		Возврат;
	КонецЕсли;
		
	// Формируем внутренние значения полей по тексту и параметрам формирования из
	// реквизита ВидКонтактнойИнформацииАдресаДоставки.
	АдресМОДСтрокой = Текст;
	АдресМОД = ОбщегоНазначенияИСВызовСервера.ЗначенияПолейКонтактнойИнформации(
		Текст, ВидКонтактнойИнформацииАдресаМОД);
	
	ЗаполнитьПолеКодаФИАС();
		
КонецПроцедуры

&НаКлиенте
Процедура АдресМОДСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	// Сбрасываем как представления, так и внутренние значения полей.
	ОчиститьВнутренниеЗначенияПолейАдресаМОД();
	ЗаполнитьПолеКодаФИАС();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМОДСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		// Отказ от выбора, данные неизменны.
		Возврат;
	КонецЕсли;
	
	АдресМОДСтрокой      = ВыбранноеЗначение.Представление;
	АдресМОД             = ВыбранноеЗначение.КонтактнаяИнформация;
	КомментарийАдресаМОД = ВыбранноеЗначение.Комментарий;
	
	ЗаполнитьПолеКодаФИАС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьКППОрганизацияПодразделение();	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьКППОрганизацияПодразделение();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТоварныеГруппы Цикл
		СтрокаТЧ.Выбрана = Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТоварныеГруппы Цикл
		СтрокаТЧ.Выбрана = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьВГИСМТ(Команда)
	
	ОчиститьСообщения();
	
	ТоварныеГруппыМОД = Новый Массив;
	
	Если Не МножественнаяРегистрацияМОД Тогда
		Если Не ЗначениеЗаполнено(КодФИАС) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Код ФИАС""'"), , "КодФИАС");
			Возврат;
		КонецЕсли;

		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Выбрана", Истина);
		НайденныеСтроки = ТоварныеГруппы.НайтиСтроки(ПараметрыОтбора);

		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			ТоварныеГруппыМОД.Добавить(СтрокаТЧ.ТоварнаяГруппа);
		КонецЦикла;

		Если Не ТоварныеГруппыМОД.Количество() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны товарные группы.'"), , "ТоварныеГруппы");
			Возврат;
		КонецЕсли;

		Если Не РегистрацияМОДВСтороннейФорме Тогда
			Если Не ЗначениеЗаполнено(Организация) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Организация""'"), ,
					"Организация");
				Возврат;
			КонецЕсли;
			
			Если Не ОбщегоНазначенияИСВызовСервера.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(Организация) Тогда
				Если Не ЗначениеЗаполнено(КПП) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""КПП""'"), , "КПП");
					Возврат;
				Иначе
					ТекстСообщения = "";
					Если Не РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстСообщения) Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "КПП");
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
	ПараметрыРегистрацииМОДВГИСМТ = ПодготовитьМОДКРегистрацииВГИСМТ(ТоварныеГруппыМОД);

	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("СписокМОД", ПараметрыРегистрацииМОДВГИСМТ.СписокМОДКРегистрации);

	ПослеРегистрацииМОД = Новый ОписаниеОповещения("ПослеРегистрацииМОДВГИСМТ", ЭтотОбъект,
		ПараметрыРегистрацииМОДВГИСМТ.ДанныеДляЗаписиПослеРегистрации);

	ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.Организация             = Организация;
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеРегистрацииМОД;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыРегистрации;

	ИнтерфейсИСМПОбщегоНазначенияКлиент.РегистрацияМестОсуществленияДеятельностиГИСМТ(ПараметрыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПервоначальныеСведения()
	
	РегистрацияМОДВСтороннейФорме = Параметры.НезависимаяРегистрацияМОД;
	ПараметрыРегистрацииМОД       = Параметры.СписокМОДКРегистрации;
	ТоварныеГруппыОтбор           = Новый Массив;
	
	Если ПараметрыРегистрацииМОД <> Неопределено Тогда
		МножественнаяРегистрацияМОД = ПараметрыРегистрацииМОД.Количество() > 1;
	КонецЕсли;
	
	Для Каждого МОДКРегистрации Из ПараметрыРегистрацииМОД Цикл
		Если МножественнаяРегистрацияМОД Тогда
			СтрокаРегистрируемогоМОД = СписокМОДКРегистрации.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаРегистрируемогоМОД, МОДКРегистрации);
			
			СтрокаРегистрируемогоМОД.ТоварнаяГруппа = МОДКРегистрации.ТоварныеГруппы[0];

		Иначе
			Если ЗначениеЗаполнено(МОДКРегистрации.Организация) Тогда
				Организация = МОДКРегистрации.Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(МОДКРегистрации.Подразделение) Тогда
				Подразделение = МОДКРегистрации.Подразделение;
			КонецЕсли;

			Если ЗначениеЗаполнено(МОДКРегистрации.ДанныеАдреса) Тогда
				АдресМОД        = МОДКРегистрации.ДанныеАдреса;
				АдресМОДСтрокой = МОДКРегистрации.ДанныеАдресаСтрокой;
			КонецЕсли;

			Если ЗначениеЗаполнено(МОДКРегистрации.КодФИАС) Тогда
				КодФИАС = МОДКРегистрации.КодФИАС;
			Иначе
				ЗаполнитьПолеКодаФИАС();
			КонецЕсли;
			
			ТоварныеГруппыОтбор = МОДКРегистрации.ТоварныеГруппы;

		КонецЕсли;

	КонецЦикла;
	
	Если Не МножественнаяРегистрацияМОД Тогда
		ДоступныеТоварныеГруппы = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ДоступныеТоварныеГруппыСВозможностьюРегистрацииМОД(); 

		Для Каждого ТоварнаяГруппа Из ДоступныеТоварныеГруппы Цикл
			СтрокаТоварныхГрупп = ТоварныеГруппы.Добавить();
			СтрокаТоварныхГрупп.ТоварнаяГруппа = ТоварнаяГруппа;
			СтрокаТоварныхГрупп.Выбрана        = ТоварныеГруппыОтбор.Найти(ТоварнаяГруппа) <> Неопределено;
		КонецЦикла;

		ВидКонтактнойИнформацииАдресаМОД = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(
			Перечисления.ТипыКонтактнойИнформации.Адрес);

		ЗаполнитьКППОрганизацияПодразделение();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ГруппаОписание.Видимость                    = РегистрацияМОДВСтороннейФорме И ЗначениеЗаполнено(АдресМОДСтрокой);
	Элементы.ГруппаМножественнаяРегистрацияМОД.Видимость = МножественнаяРегистрацияМОД;
	Элементы.ГруппаОдиночнаяРегистрацияМОД.Видимость     = Не МножественнаяРегистрацияМОД;	
	
	Если РегистрацияМОДВСтороннейФорме Тогда
		Если МножественнаяРегистрацияМОД Тогда
			ОписаниеПричиныРегистрации = НСтр("ru = 'По результатам проверки в ГИС МТ указанные адреса не найдены в списке МОД организации.'");
		Иначе
			ОписаниеПричиныРегистрации = НСтр("ru = 'По результатам проверки в ГИС МТ указанный адрес не найден в списке МОД организации.'");
		КонецЕсли;
		
		Элементы.ОписаниеРегистрацииМОД.Заголовок = ОписаниеПричиныРегистрации;
		
		Элементы.ГруппаШапкаЛево.Видимость = Ложь;
		Элементы.КПП.Вид                   = ВидПоляФормы.ПолеНадписи;
		
		Если ЗначениеЗаполнено(АдресМОДСтрокой) Тогда
			Элементы.АдресМОДСтрокой.Вид = ВидПоляФормы.ПолеНадписи;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодФИАС) Тогда
			Элементы.КодФИАС.Вид = ВидПоляФормы.ПолеНадписи;
		КонецЕсли;
		
	Иначе
		Элементы.КодФИАС.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВнутренниеЗначенияПолейАдресаМОД()
	
	АдресМОД             = "";
	АдресМОДСтрокой      = "";
	КомментарийАдресаМОД = "";
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолеКодаФИАС()
	
	КодФИАС = ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(АдресМОД).Идентификатор; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКППОрганизацияПодразделение()
	
	РеквизитыОрганизации = ОбщегоНазначенияИС.ИННКППGLNОрганизации(Организация, Подразделение);
	
	ИНН = РеквизитыОрганизации.ИНН;
	КПП = РеквизитыОрганизации.КПП;	
		
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьМОДКРегистрацииВГИСМТ(ТоварныеГруппыМОД = Неопределено)
	
	ДанныеДляРегистрации = Новый Структура;
	ДанныеДляРегистрации.Вставить("ДанныеДляЗаписиПослеРегистрации", Новый Массив);
	ДанныеДляРегистрации.Вставить("СписокМОДКРегистрации",           Новый Массив);
	
	ДанныеДляЗаписиПослеРегистрации = Новый Массив;
	РегистрируемыеМОДы              = Новый Массив;
	
	Если Не МножественнаяРегистрацияМОД Тогда
		ПараметрыЗаписиПослеРегистрации = Новый Структура;
		ПараметрыЗаписиПослеРегистрации.Вставить("Владелец",            Организация);
		ПараметрыЗаписиПослеРегистрации.Вставить("ДанныеАдреса",        АдресМОД);
		ПараметрыЗаписиПослеРегистрации.Вставить("ПредставлениеАдреса", АдресМОДСтрокой);
		ПараметрыЗаписиПослеРегистрации.Вставить("ТоварныеГруппы",      ТоварныеГруппыМОД);
		ПараметрыЗаписиПослеРегистрации.Вставить("КодФИАС",             КодФИАС);
		ПараметрыЗаписиПослеРегистрации.Вставить("КПП",                 КПП);
		ПараметрыЗаписиПослеРегистрации.Вставить("ИНН",                 ИНН);

		ДанныеДляЗаписиПослеРегистрации.Добавить(ПараметрыЗаписиПослеРегистрации);

		МОДКРегистрации = Новый Структура;
		МОДКРегистрации.Вставить("КодФИАС",        КодФИАС);
		МОДКРегистрации.Вставить("КПП",            КПП);
		МОДКРегистрации.Вставить("ТоварныеГруппы", ТоварныеГруппыМОД);

		РегистрируемыеМОДы = Новый Массив;
		РегистрируемыеМОДы.Добавить(МОДКРегистрации);
		
	Иначе
		УникальныеГруппы = Новый Соответствие;
		
		Для каждого СтрокаМОД Из СписокМОДКРегистрации Цикл
			КлючУникальности       = СтрокаМОД.КПП + "," + СтрокаМОД.КодФИАС;
			СтруктураПоКППКодуФИАС = УникальныеГруппы.Получить(КлючУникальности);
			
			Если СтруктураПоКППКодуФИАС = Неопределено Тогда
				СписокТоварныхГрупп = Новый Массив;
				СписокТоварныхГрупп.Добавить(СтрокаМОД.ТоварнаяГруппа);
				
				МОДКРегистрации = Новый Структура;
				МОДКРегистрации.Вставить("КодФИАС",        СтрокаМОД.КодФИАС);
				МОДКРегистрации.Вставить("КПП",            СтрокаМОД.КПП);
				МОДКРегистрации.Вставить("ТоварныеГруппы", СписокТоварныхГрупп);
				
				УникальныеГруппы.Вставить(КлючУникальности, МОДКРегистрации);
				
			Иначе
				СписокТоварныхГрупп = СтруктураПоКППКодуФИАС.ТоварныеГруппы;
				
				Если СписокТоварныхГрупп.Найти(СтрокаМОД.ТоварнаяГруппа) = Неопределено Тогда
					СписокТоварныхГрупп.Добавить(СтрокаМОД.ТоварнаяГруппа);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из УникальныеГруппы Цикл
			РегистрируемыйМОД = КлючИЗначение.Значение;
			
			РегистрируемыеМОДы.Добавить(РегистрируемыйМОД);

			ПараметрыЗаписиПослеРегистрации = Новый Структура;
			ПараметрыЗаписиПослеРегистрации.Вставить("КодФИАС",        РегистрируемыйМОД.КодФИАС);
			ПараметрыЗаписиПослеРегистрации.Вставить("КПП",            РегистрируемыйМОД.КПП);
			ПараметрыЗаписиПослеРегистрации.Вставить("ТоварныеГруппы", РегистрируемыйМОД.ТоварныеГруппы);
			
			ПараметрыОтбора = Новый Структура("КПП, КодФИАС");
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, РегистрируемыйМОД);
			
			СписокПоКППКодуФИАС = СписокМОДКРегистрации.НайтиСтроки(ПараметрыОтбора);
			Если СписокПоКППКодуФИАС.Количество() Тогда
				ПараметрыЗаписиПослеРегистрации.Вставить("Владелец",            СписокПоКППКодуФИАС[0].Организация);
				ПараметрыЗаписиПослеРегистрации.Вставить("ДанныеАдреса",        СписокПоКППКодуФИАС[0].ДанныеАдреса);
				ПараметрыЗаписиПослеРегистрации.Вставить("ПредставлениеАдреса", СписокПоКППКодуФИАС[0].ДанныеАдресаСтрокой);
				ПараметрыЗаписиПослеРегистрации.Вставить("ИНН",                 СписокПоКППКодуФИАС[0].ИНН);
			КонецЕсли;
			
			ДанныеДляЗаписиПослеРегистрации.Добавить(ПараметрыЗаписиПослеРегистрации);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеДляРегистрации.ДанныеДляЗаписиПослеРегистрации = ДанныеДляЗаписиПослеРегистрации;
	ДанныеДляРегистрации.СписокМОДКРегистрации           = РегистрируемыеМОДы;
	
	Возврат ДанныеДляРегистрации;
	
КонецФункции

&НаКлиенте
Процедура ПослеРегистрацииМОДВГИСМТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Результат.Количество() Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось зарегистрировать МОД.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	РезультатРегистрации = Результат.Результат[0];
	
	Если РезультатРегистрации.КодРезультата <> 201 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатРегистрации.ОписаниеРезультата);
	Иначе
		ДобавитьМОДЗарегистрированныеВСервисе(ДополнительныеПараметры);
		
		ПараметрыЗавершенияРегистрацииМОД = Неопределено;
		
		Если РегистрацияМОДВСтороннейФорме Тогда
			ПараметрыЗавершенияРегистрацииМОД = Новый Структура;
			ПараметрыЗавершенияРегистрацииМОД.Вставить("МОДЗарегистрирован", Истина);
			ПараметрыЗавершенияРегистрацииМОД.Вставить("МОД",                ДополнительныеПараметры);
		КонецЕсли;
		
		Закрыть(ПараметрыЗавершенияРегистрацииМОД);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМОДЗарегистрированныеВСервисе(ПараметрыРегистрации)
	
	ДополнительныеПараметры = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ИнициализироватьПараметрыЗаписиМОД();
	ДополнительныеПараметры.Вставить("Регистрация", Истина);
	
	РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ОбновитьСписокМестОсуществленияДеятельности(ПараметрыРегистрации, 
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
